app/controllers/blogs_controller.rb

SELECT  `blogs`.* FROM `blogs` LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `blogs`
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`category_id` = 6
---
	def index
		@blogs = Blog.all.page(params[:page]).per(3)
    @blogs = @blogs.where(category_id: params[:category_id]) if params[:category_id].present?

SELECT `categories`.* FROM `categories`
---
	def new
		@new_blog = Blog.new()
    @categories = Category.all.collect

INSERT INTO `blogs` (`title`, `content`, `user_id`, `category_id`, `created_at`, `updated_at`) VALUES ('eqw', 'eqweeqưeqw', 5, 3, '2017-10-11 08:19:34', '2017-10-11 08:19:34')
---
	def create
      @blog = Blog.new(blog_params)
      @blog.user_id = current_user.id
      if @blog.save

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
  def edit
    @edit_blog = Blog.find(params[:id])

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 11 LIMIT 1
UPDATE `blogs` SET `title` = '21221', `content` = '212112', `updated_at` = '2017-10-11 09:05:14' WHERE `blogs`.`id` = 11
---
  def update
    @update_blog = Blog.find(params[:id])
    @update_blog.update(blog_params)

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 7 LIMIT 1
---
  def show
    @blog_detail = Blog.find(params[:id])

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 11 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 11
---
  def destroy
      @blog_destroy = Blog.find(params[:id])
      @blog_destroy.destroy