app/controllers/categorys_controller.rb

	def index
	  @categories = Category.all.page(params[:page]).per(3)
---
SELECT COUNT(*) FROM `categories`
SELECT `categories`.* FROM `categories`

  def show
    @category = Blog.where(category_id: params[:id]).all.page(params[:page]).per(3)
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`category_id` = 3 LIMIT 3 OFFSET 0

	def create
    @blog = Category.new(category_params)
    if @blog.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('e32r32eqw', '2017-10-10 09:14:20', '2017-10-10 09:14:20')

  def edit
    @edit_category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 8 LIMIT 1

  def update
    @update_category = Category.find(params[:id])
    @update_category.update(category_params)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
UPDATE `categories` SET `name` = 'ngoccanh', `updated_at` = '2017-10-11 02:50:06' WHERE `categories`.`id` = 3

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 9 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 9