app/controllers/home_controller.rb

  def index
  	@all_blogs = Blog.all
---
SELECT `blogs`.* FROM `blogs`