app/views/layouts/_navigation.html.slim

    .collapse.navbar-collapse
      - Category.all.each do |category|
---
SELECT `categories`.* FROM `categories`